In [0]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt 
%matplotlib inline

In [5]:
!curl -o new.zip https://transfer.sh/S6P39/datafiles

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  897k  100  897k    0     0   897k      0  0:00:01  0:00:01 --:--:--  524k

In [6]:
!unzip new.zip

Archive:  new.zip
  inflating: u.data
  inflating: u.item
  inflating: Movie_Id_Titles

In [0]:
cols=["user_id","item_id","ratings","timestamp"]

In [0]:
movie_rating=pd.read_csv("u.data",sep="\t",names=cols)

In [0]:
df=pd.read_csv("u.data",sep="\t",names=cols)

In [12]:
movie_rating.head()

   user_id  item_id  ratings  timestamp
0        0       50        5  881250949
1        0      172        5  881250949
2        0      133        1  881250949
3      196      242        3  881250949
4      186      302        3  891717742

In [10]:
movie_title=pd.read_csv("Movie_Id_Titles")
movie_title.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

In [0]:
df=pd.merge(movie_rating,movie_title,on="item_id")

In [15]:
df.head()

   user_id  item_id  ratings  timestamp             title
0        0       50        5  881250949  Star Wars (1977)
1      290       50        5  880473582  Star Wars (1977)
2       79       50        4  891271545  Star Wars (1977)
3        2       50        5  888552084  Star Wars (1977)
4        8       50        5  879362124  Star Wars (1977)

In [0]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [23]:
df.groupby("title").count().sort_values("ratings",ascending=False).head()

                           user_id  item_id  ratings  timestamp
title
Star Wars (1977)               584      584      584        584
Contact (1997)                 509      509      509        509
Fargo (1996)                   508      508      508        508
Return of the Jedi (1983)      507      507      507        507
Liar Liar (1997)               485      485      485        485

In [24]:
df.groupby("title")["ratings"].mean().sort_values(ascending=False).head()

title
Marlene Dietrich: Shadow and Light (1996)     5.0
Prefontaine (1997)                            5.0
Santa with Muscles (1996)                     5.0
Star Kid (1997)                               5.0
Someone Else's America (1995)                 5.0
Name: ratings, dtype: float64

In [0]:
ratings=pd.DataFrame(df.groupby("title")["ratings"].mean())

In [26]:
ratings.head()

                            ratings
title
'Til There Was You (1997)  2.333333
1-900 (1994)               2.600000
101 Dalmatians (1996)      2.908257
12 Angry Men (1957)        4.344000
187 (1997)                 3.024390